#  Q1. Work with the sharing bike dataset: Sharing_Bike.db

In [1]:
import pandas as pd
import sqlite3

In [2]:
conn = sqlite3.connect('dataset/Sharing_Bike.db')

df = pd.read_sql_query("SELECT * FROM bike", conn)
df.describe()

            instant           hr       casual   registered          cnt
count   8734.000000  8734.000000  8734.000000  8734.000000  8734.000000
mean   13012.500000    11.520151    42.679757   191.986604   234.666361
std     2521.432959     6.921208    56.970413   175.481637   208.910941
min     8646.000000     0.000000     0.000000     0.000000     1.000000
25%    10829.250000     6.000000     5.000000    46.000000    53.000000
50%    13012.500000    12.000000    20.000000   156.000000   191.000000
75%    15195.750000    18.000000    60.000000   275.000000   347.000000
max    17379.000000    23.000000   367.000000   886.000000   977.000000

A. Considering the holidays, write a SQL code to calculate the total count of casual users and the
total count of registered users in each holiday of 2012.

In [3]:
#a group by holidays or day is wrong because it will not give each holidays but each day of holidays.

df_A = pd.read_sql_query("""
SELECT sum(casual) as total_casual, sum(registered) as total_registered
FROM bike
JOIN Calendar C on bike.dteday = C.dteday
WHERE C.holiday = 1
""", conn)

df_A

   total_casual  total_registered
0         12611             35802

B. (4 pts) Considering 24 hours in a day, write a SQL code to calculate the average count of casual users
and the average count of registered users for each hour.

In [4]:
#I use 365 instead of count(*) because it is the number of days in a year and I verified that the number of days is 365 for this database.

df_B = pd.read_sql_query("""
SELECT hr,(sum(casual)/365) as average_total_casual_by_hour, (sum(registered)/365) as average_total_registered_by_hour
FROM bike
GROUP BY hr
""", conn)

df_B

    hr  average_total_casual_by_hour  average_total_registered_by_hour
0    0                            10                                53
1    1                             7                                32
2    2                             5                                21
3    3                             2                                10
4    4                             1                                 5
5    5                             1                                23
6    6                             4                                89
7    7                            11                               254
8    8                            24                               429
9    9                            37                               236
10  10                            56                               158
11  11                            73                               186
12  12                            84                               231
13  13                            89                               227
14  14                            93                               205
15  15                            92                               221
16  16                            90                               298
17  17                            89                               483
18  18                            72                               455
19  19                            57                               328
20  20                            42                               236
21  21                            32                               177
22  22                            25                               133
23  23                            16                                89

C. (4 pts) Output the top 20 dates of the highest total counts of casual users in 2012 with a SQL code.

In [5]:
df_C = pd.read_sql_query("""
SELECT dteday, sum(casual) as total
FROM bike
GROUP BY dteday
ORDER BY total DESC
LIMIT 20
""", conn)

df_C

        dteday  total
0   2012-05-19   3410
1   2012-05-27   3283
2   2012-04-07   3252
3   2012-09-15   3160
4   2012-03-17   3155
5   2012-10-06   3031
6   2012-06-16   2963
7   2012-05-26   2855
8   2012-04-15   2846
9   2012-08-18   2827
10  2012-10-20   2806
11  2012-06-02   2795
12  2012-04-14   2795
13  2012-06-09   2708
14  2012-05-20   2704
15  2012-06-23   2657
16  2012-10-27   2643
17  2012-06-17   2634
18  2012-05-12   2622
19  2012-09-02   2613